app/controllers/quotes_controller.rb

SELECT  "quotes".* FROM "quotes" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def index
    @quote = Quote.order("RANDOM()").first

INSERT INTO "quotes" ("saying", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["saying", "Aut sit nostrud sit"], ["author", "Sunt ipsum maxime en"], ["created_at", "2019-08-12 17:56:44.136991"], ["updated_at", "2019-08-12 17:56:44.136991"]]
---
  def create
    @quote = Quote.create(quote_params)